In [1]:
import pandas as pd
import numpy as np

In [2]:
score = [[12, 20, 18],[12, 8, 19],[13, 14, 6],[20, 16, 9]]

In [3]:
df = pd.DataFrame(data=score)
df

    0   1   2
0  12  20  18
1  12   8  19
2  13  14   6
3  20  16   9

In [4]:
dars = ['Python', 'C++', 'Java']
name = ['Ali', 'Sara', 'Taha', 'Mahsa']

In [5]:
# make DataFrame by list
df = pd.DataFrame(data=score, index=name, columns=dars)
df

       Python  C++  Java
Ali        12   20    18
Sara       12    8    19
Taha       13   14     6
Mahsa      20   16     9

In [6]:
# make DataFrame by dictionary
d = {'Python':[12, 12, 13, 20], 'C++':[8, 20, 14, 16], 'Java':[19, 18, 6, 9]}
name = ['Ali', 'Sara', 'Taha', 'Mahsa']
students = pd.DataFrame(data=d, index=name)
students

       Python  C++  Java
Ali        12    8    19
Sara       12   20    18
Taha       13   14     6
Mahsa      20   16     9

In [7]:
df = pd.DataFrame(data=score, index=name, columns=dars)
df

       Python  C++  Java
Ali        12   20    18
Sara       12    8    19
Taha       13   14     6
Mahsa      20   16     9

In [8]:
df.values

array([[12, 20, 18],
       [12,  8, 19],
       [13, 14,  6],
       [20, 16,  9]], dtype=int64)

In [9]:
df.columns

Index(['Python', 'C++', 'Java'], dtype='object')

In [10]:
df.index

Index(['Ali', 'Sara', 'Taha', 'Mahsa'], dtype='object')

In [11]:
'Java' in df.columns

True

In [12]:
df.axes

[Index(['Ali', 'Sara', 'Taha', 'Mahsa'], dtype='object'),
 Index(['Python', 'C++', 'Java'], dtype='object')]

In [13]:
df.dtypes

Python    int64
C++       int64
Java      int64
dtype: object

## Indexing, Selection and Filtering

In [14]:
df

       Python  C++  Java
Ali        12   20    18
Sara       12    8    19
Taha       13   14     6
Mahsa      20   16     9

In [15]:
df['Python']

Ali      12
Sara     12
Taha     13
Mahsa    20
Name: Python, dtype: int64

In [16]:
df['C++']

Ali      20
Sara      8
Taha     14
Mahsa    16
Name: C++, dtype: int64

In [17]:
df[['Python','C++']]

       Python  C++
Ali        12   20
Sara       12    8
Taha       13   14
Mahsa      20   16

In [18]:
df[:2]

      Python  C++  Java
Ali       12   20    18
Sara      12    8    19

In [19]:
df[:2]['C++']

Ali     20
Sara     8
Name: C++, dtype: int64

In [20]:
df[:2][['C++','Java']]

      C++  Java
Ali    20    18
Sara    8    19

In [21]:
df

       Python  C++  Java
Ali        12   20    18
Sara       12    8    19
Taha       13   14     6
Mahsa      20   16     9

In [22]:
df < 10

       Python    C++   Java
Ali     False  False  False
Sara    False   True  False
Taha    False  False   True
Mahsa   False  False   True

In [23]:
df[df<10] = 0
df

       Python  C++  Java
Ali        12   20    18
Sara       12    0    19
Taha       13   14     0
Mahsa      20   16     0

In [24]:
df[df['Python'] > 14]

       Python  C++  Java
Mahsa      20   16     0

## loc, iloc

In [25]:
df = pd.DataFrame(data=score, index=name, columns=dars)
df

       Python  C++  Java
Ali        12   20    18
Sara       12    8    19
Taha       13   14     6
Mahsa      20   16     9

In [26]:
df.loc['Taha']

Python    13
C++       14
Java       6
Name: Taha, dtype: int64

In [27]:
df.iloc[2]

Python    13
C++       14
Java       6
Name: Taha, dtype: int64

In [28]:
df.iloc[[2]]

      Python  C++  Java
Taha      13   14     6

In [29]:
df.loc['Taha', ['Python', 'Java']]

Python    13
Java       6
Name: Taha, dtype: int64

In [30]:
df.loc[['Taha'], ['Python', 'Java']]

      Python  Java
Taha      13     6

In [31]:
df.iloc[2,[0,2]]

Python    13
Java       6
Name: Taha, dtype: int64

In [32]:
df.iloc[[2],[0,2]]

      Python  Java
Taha      13     6

In [33]:
df

       Python  C++  Java
Ali        12   20    18
Sara       12    8    19
Taha       13   14     6
Mahsa      20   16     9

In [34]:
df.loc[:'Taha', 'Python']

Ali     12
Sara    12
Taha    13
Name: Python, dtype: int64

In [35]:
df.iloc[:3, 0]

Ali     12
Sara    12
Taha    13
Name: Python, dtype: int64

In [36]:
df

       Python  C++  Java
Ali        12   20    18
Sara       12    8    19
Taha       13   14     6
Mahsa      20   16     9

In [37]:
df.iloc[:3, [0, 1]]

      Python  C++
Ali       12   20
Sara      12    8
Taha      13   14

In [38]:
df.iloc[0,1]

20

In [39]:
df.iloc[[0,1]]

      Python  C++  Java
Ali       12   20    18
Sara      12    8    19

In [40]:
df.iloc[[True, False, True, True]]

       Python  C++  Java
Ali        12   20    18
Taha       13   14     6
Mahsa      20   16     9

In [41]:
df.iloc[:, [True, False, True]]

       Python  Java
Ali        12    18
Sara       12    19
Taha       13     6
Mahsa      20     9

In [42]:
df.iloc[[True, False, True, True], [True, False, True]]

       Python  Java
Ali        12    18
Taha       13     6
Mahsa      20     9

## iat:  Access a single value for a row/column pair by integer position

In [43]:
df

       Python  C++  Java
Ali        12   20    18
Sara       12    8    19
Taha       13   14     6
Mahsa      20   16     9

In [44]:
df.iat[2,1]

14

In [45]:
df.iat[0,1]

20

In [46]:
df.iloc[0]

Python    12
C++       20
Java      18
Name: Ali, dtype: int64

In [47]:
df.iloc[0].iat[1]

20

## reindex

In [48]:
df

       Python  C++  Java
Ali        12   20    18
Sara       12    8    19
Taha       13   14     6
Mahsa      20   16     9

In [49]:
df.reindex(['Ali', 'Sara', 'Taha', 'Mahsa', 'Omid'], fill_value=0)

       Python  C++  Java
Ali        12   20    18
Sara       12    8    19
Taha       13   14     6
Mahsa      20   16     9
Omid        0    0     0

In [50]:
df.reindex(columns=['Python', 'C++', 'Java', 'Pascal'], fill_value=0)

       Python  C++  Java  Pascal
Ali        12   20    18       0
Sara       12    8    19       0
Taha       13   14     6       0
Mahsa      20   16     9       0

## sort_value

In [51]:
df

       Python  C++  Java
Ali        12   20    18
Sara       12    8    19
Taha       13   14     6
Mahsa      20   16     9

In [57]:
df.sort_values(by='Python')

       Python  C++  Java
Ali        12   20    18
Sara       12    8    19
Taha       13   14     6
Mahsa      20   16     9

In [58]:
df.sort_values(by='Python', ascending=False)

       Python  C++  Java
Mahsa      20   16     9
Taha       13   14     6
Ali        12   20    18
Sara       12    8    19

In [59]:
df.sort_values(by=['Python', 'C++'])

       Python  C++  Java
Sara       12    8    19
Ali        12   20    18
Taha       13   14     6
Mahsa      20   16     9

## sort_index

In [60]:
df.sort_index()

       Python  C++  Java
Ali        12   20    18
Mahsa      20   16     9
Sara       12    8    19
Taha       13   14     6

In [61]:
df.sort_index(axis=1)

       C++  Java  Python
Ali     20    18      12
Sara     8    19      12
Taha    14     6      13
Mahsa   16     9      20

In [62]:
df.sort_index(axis=1, ascending=False)

       Python  Java  C++
Ali        12    18   20
Sara       12    19    8
Taha       13     6   14
Mahsa      20     9   16

## idxmax

In [63]:
df

       Python  C++  Java
Ali        12   20    18
Sara       12    8    19
Taha       13   14     6
Mahsa      20   16     9

In [64]:
df.idxmax()

Python    Mahsa
C++         Ali
Java       Sara
dtype: object

## sum, mean, describe

In [65]:
df

       Python  C++  Java
Ali        12   20    18
Sara       12    8    19
Taha       13   14     6
Mahsa      20   16     9

In [66]:
df.sum()

Python    57
C++       58
Java      52
dtype: int64

In [67]:
df.sum(axis='columns')

Ali      50
Sara     39
Taha     33
Mahsa    45
dtype: int64

In [68]:
df.mean()

Python    14.25
C++       14.50
Java      13.00
dtype: float64

In [69]:
df.mean(axis='columns')

Ali      16.666667
Sara     13.000000
Taha     11.000000
Mahsa    15.000000
dtype: float64

In [70]:
df.mean(axis='columns', skipna=False)

Ali      16.666667
Sara     13.000000
Taha     11.000000
Mahsa    15.000000
dtype: float64

In [71]:
df.describe()

         Python   C++       Java
count   4.00000   4.0   4.000000
mean   14.25000  14.5  13.000000
std     3.86221   5.0   6.480741
min    12.00000   8.0   6.000000
25%    12.00000  12.5   8.250000
50%    12.50000  15.0  13.500000
75%    14.75000  17.0  18.250000
max    20.00000  20.0  19.000000